# Словарь соответствий между буквами и кодами в азбуке Морзе
MORSE_CODE = {'A': '.-', 'B': '-...', 'C': '-.-.', 'D': '-..', 'E': '.', 'F': '..-.', 'G': '--.', 'H': '....',
              'I': '..', 'J': '.---', 'K': '-.-', 'L': '.-..', 'M': '--', 'N': '-.', 'O': '---', 'P': '.--.',
              'Q': '--.-', 'R': '.-.', 'S': '...', 'T': '-', 'U': '..-', 'V': '...-', 'W': '.--', 'X': '-..-',
              'Y': '-.--', 'Z': '--..'}

# Исходный текст
text = "HELLO WORLD"

# Разбиваем текст на слова
words = text.split()

# Кодируем каждое слово в азбуке Морзе
for word in words:
    # Преобразуем все буквы в верхний регистр
    word = word.upper()
    # Кодируем каждую букву в слове
    morse_word = ""
    for letter in word:
        # Если буква есть в словаре, добавляем ее код в результирующую строку
        if letter in MORSE_CODE:
            morse_word += MORSE_CODE[letter] + " "
            # Выводим закодированное слово и символ перевода строки
    print(morse_word[:-1])